app/controllers/api/trucks_controller.rb

SELECT "trucks".* FROM "trucks" ORDER BY created_at DESC
---
		def index
			trucks = Truck.order('created_at DESC')

SELECT "trucks".* FROM "trucks" WHERE "trucks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
		def show
			truck = Truck.find(params[:id])

INSERT INTO "trucks" ("name", "address", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Sean"], ["address", "Empire State"], ["latitude", 51.4536869], ["longitude", -0.4289347], ["created_at", "2019-09-19 05:28:55.284672"], ["updated_at", "2019-09-19 05:28:55.284672"]]
---
		def create
			truck = Truck.new(truck_params)
			if truck.save

SELECT "trucks".* FROM "trucks" WHERE "trucks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "trucks" SET "address" = $1, "latitude" = $2, "longitude" = $3, "updated_at" = $4 WHERE "trucks"."id" = $5  [["address", "Empire State"], ["latitude", 51.4536869], ["longitude", -0.4289347], ["updated_at", "2019-09-19 04:38:23.851179"], ["id", 2]]
---
		def update
    		truck = Truck.find(params[:id])
    		if truck.update(truck_params)

SELECT "trucks".* FROM "trucks" WHERE "trucks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "trucks" WHERE "trucks"."id" = $1  [["id", 2]]
---
  		def destroy
    		truck = Truck.find(params[:id])
    		truck.destroy